# 大物实验10各向异性数据分析
cmc = __import__("common math calculate")


def experiment1_1():
    "AMR磁电转换特性的测量"
    I = [i for i in range(-300, 350, 50)][::-1]  # 电流注记/mA
    B = [i for i in range(-6, 7)][::-1] # 磁感应强度/B
    V = [1.500, 1.268, 1.023, 0.774, 0.517, 0.260, 0,
         -0.261, -0.518, -0.768, -1.013, -1.244, -1.465]  # 输出电压/V
    cmc.Least_squares(B, V, mod=0,title='AMR磁电转化特性曲线',xlabel = "磁感应强度/B"
                      ,ylabel = '输出电压/V')


def experiment1_2():
    "测量磁阻传感器的各向异性特性"
    α = [10 * i for i in range(10)]  # 夹角α/°
    V = [1.024, 1.014, 0.978, 0.910, 0.816,
         0.695, 0.551, 0.386, 0.204, 0.019]  # 输出电压/V
    k,b = cmc.Least_squares(α, V, mod=1,title='AMR磁方向特性曲线',xlabel = "夹角/°"
                      ,ylabel = '输出电压/V')
    print('y = ',k,'x + ',b)


def experiment2_1():
    "赫姆霍兹线圈轴线上的磁场分布测量"
    R = 0.14
    X = [i * 0.1 for i in range(-5, 6, 1)]
    Bx0 = [0.946, 0.975, 0.992, 0.998, 1.000,
           1.000, 1.000, 0.998, 0.992, 0.975, 0.946]    # B(X)计算值/V
    Bx1 = [0.973, 1.001, 1.016, 1.023, 1.024,
           1.026, 1.024, 1.022, 1.015, 0.998, 0.967]  # B(x)测量值/V
    Bx = [i * 4 for i in Bx1]   # B(X)测量值/B
    error = [cmc.relative_error(Bx1, Bx0) for Bx1,Bx0 in zip(Bx1,Bx0)]  # 测量值与理论值相对误差
    print(error)
    cmc.smooth_curve(X, Bx1, title='赫姆霍兹线圈轴线上的磁场分布特性曲线',xlabel = "位置/R"
                      ,ylabel = 'B(X)测量值/V')

def experiment2_2():
    "赫姆霍兹线圈的磁场空间分布测量"
    Bx = [[1.021, 1.021, 1.020, 1.019, 1.017, 1.016, 1.012],
          [1.021, 1.021, 1.019, 1.019, 1.018, 1.016, 1.012],
          [1.021, 1.022, 1.022, 1.023, 1.022, 1.020, 1.017],
          [1.021, 1.021, 1.022, 1.023, 1.023, 1.022, 1.019],
          [1.021, 1.021, 1.022, 1.023, 1.023, 1.023, 1.022],
          [1.017, 1.019, 1.021, 1.023, 1.025, 1.027, 1.027],
          [1.015, 1.016, 1.019, 1.024, 1.028, 1.032, 1.035], ]  # 实验数据
    pass


def experiment3():
    "地磁场测量"
    α = 30  # 磁倾角/°
    V1 = 0.249  # 最大地磁场强度/V
    V2 = 0.033  # 最小地磁场强度/V
    V = (V1 - V2) / 2  # 平均地磁场强度/V
    B = V * 4  # 地磁场强度(高斯/B)/B
    pass


experiment2_1()
