# 大物实验11光电效应数据处理
cmc = __import__("common math calculate")
V = [round(3*i) if i >= 0 else round(0.3*i,1) for i in range(-10,10+1)]

def experiment1():
    "测量普朗克常量h"
    λ = [365, 405, 436, 546, 577]   # 波长记注 / nm
    f = [8.214, 7.408, 6.879, 5.490, 5.196] # 频率 / 10e14 Hz
    Uak = [1.343, 1.049, 0.880, 0.320,0.161]    # 截止电压 / V
    e = 1.6e-19 # 元电荷 / C
    h0 = 6.626  # 普朗克常量标准值/(J·s)/e-34
    h,b = cmc.Least_squares(f,Uak,1,'测量截止电压与普朗克常量','频率(f)/10e14Hz',
    '电压(V)/V')
    h *= 1e20*e
    print('实验测得的普朗克常量为%.3fe-34,相对误差为%s。'
    %(h,cmc.relative_error(h, h0)))


def experiment2_1():
    "同一条件不同波长的伏安特性曲线(Φ=4mm,d=33.8cm)"
    Φ = 4   # 光阑常数 / nm
    d = 33.8    # 距离 / cm
    λ = [365, 405, 436, 546, 577]   # 波长记注 / nm

    def Outprint(I):
        cmc.smooth_curve(V, I, '同一条件不同波长的伏安特性曲线(Φ=4mm,d=33.8cm)'
        , '电压/V','电流I/A')

    I1 = [-97e-13, -94e-13, -86e-13, -64e-13, -30e-13, -5.35e-11, 3e-11,
            23e-11, 46e-11, 69e-11, 12e-10, 73e-10, 128e-10, 168e-10, 
            208e-10, 245e-10, 269e-10, 290e-10, 314e-10, 326e-10, 342e-10]
    I2 = [-45e-13, -45e-13, -43e-13, -38e-13, -27e-13, -7e-13, 16e-12, 
            110e-12, 218e-12, 328e-12, 461e-12, 272e-11, 421e-11, 597e-11, 
            741e-11, 853e-11, 926e-11, 987e-11, 101e-10, 108e-10, 111e-10]

    I3 = [-72e-13, -62e-13, -60e-13, -58e-13, -54e-13, -42e-13, -10e-13,
            176e-13, 172e-13, 362e-12, 567e-12, 365e-11, 606e-11, 855e-11,
              107e-10, 122e-10, 132e-10, 142e-10, 150e-10, 156e-10, 160e-10]

    I4 = [-54e-13, -52e-13, -50e-13, -48e-13, -46e-13, -46e-13, -45e-13,
              -42e-13, -8e-13, 101e-12, 335e-12, 345e-10, 568e-11, 767e-11,
              913e-10, 103e-9, 108e-9, 115e-9, 122e-9, 126e-9, 130e-9]

    I5 = [-37e-13, -36e-13, -35e-13, -33e-13, -34e-13, -33e-13, -32e-13,
              -32e-13, -25e-13, 86e-13, 169e-12, 230e-11, 380e-11, 490e-11,
              580e-10, 643e-10, 675e-10, 711e-10, 736e-10, 745e-10, 759e-10]
    I = [I1,I2,I3,I4,I5]
    for I in I:
        Outprint(V, I)
    cmc.plt.show()      # 实际标签需在cmc文件上进行修正

def experinment2_2():
    "同一条件不同光阑的伏安特性曲线(λ=577nm,d=33.8cm)"
    Φ4 = [-37e-13, -36e-13, -35e-13, -33e-13, -34e-13, -33e-13, -32e-13,
          -32e-13, -25e-13, 86e-13, 169e-12, 230e-11, 380e-11, 490e-11,
          580e-10, 643e-10, 675e-10, 711e-10, 736e-10, 745e-10, 759e-10]
    Φ2 = [-11e-13, -10e-13, -9e-13, -9e-13, -9e-13, -8e-13, -8e-13,
          -7e-13, -6e-13, 43e-13, 484e-13, 68e-11, 108e-11, 142e-11,
          162e-10, 180e-10, 190e-10, 198e-10, 204e-10, 210e-10, 213e-10]
    Φ8 = [-127e-13, -118e-13, -115e-13, -110e-13, -109e-13, -107e-13, -104e-13,
          -101e-13, -96e-13, -27e-13, 330e-12, 101e-10, 175e-10, 228e-10,
          265e-10, 305e-10, 329e-10, 340e-10, 345e-10, 350e-10, 360e-10]

    def Outprint(I):
        cmc.smooth_curve(V, I, '同一条件不同光阑的伏安特性曲线(λ=577nm,d=33.8cm)',
        '电压/V', '电流I/A')
    I = [Φ2, Φ4, Φ8]
    for I in I:
        Outprint(I)
    cmc.plt.show()      # 实际标签需在cmc文件上进行修正


def experiment2_3():
    "同一条件下不同距离的伏安特性曲线(λ=577nm,Φ=8mm)"
    # d1 = 33.8 cm
    d1 = [-127e-13, -118e-13, -115e-13, -110e-13, -109e-13, -107e-13, -104e-13,
        -101e-13, -96e-13, -27e-13, 330e-12, 101e-10, 175e-10, 228e-10,
        265e-10, 305e-10, 329e-10, 340e-10, 345e-10, 350e-10, 360e-10]
    # d2 = 28.8 cm
    d2 = [-176e-13, -175e-13, -175e-13, -174e-13, -174e-13, -173e-13, -172e-13,
        -172e-13, -153e-13, 46e-13, 695e-12, 170e-10, 287e-10, 369e-10,
        445e-10, 497e-10, 537e-10, 565e-10, 585e-10, 600e-10, 620e-10]
    # d3 = 23.8 cm
    d3 = [-345e-13, -339e-13, -330e-13, -330e-13, -330e-13, -330e-13, -320e-13,
        -326e-13, -320e-13, -312e-13, -265e-13, 185e-10, 422e-11, 596e-11,
        738e-10, 841e-10, 930e-10, 997e-10, 1043e-10, 1082e-10, 1118e-10]

    def Outprint(I):
        cmc.smooth_curve(V, I, '同一条件不同距离的伏安特性曲线(λ=577nm,Φ=8mm)',
                         '电压/V', '电流I/A')
    I = [d1, d2, d3]
    for I in I:
        Outprint(I)
    cmc.plt.show()      # 实际标签需在cmc文件上进行修正


experiment1()
#experiment2_1()
#experinment2_2()
#experiment2_3()
